# GetClassByStyle

```pascal
FUNCTION GetClassByStyle(hObject : HANDLE): BOOLEAN;
```

```python
def vs.GetClassByStyle(hObject):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE|   |

## Version
Availability: from Vectorworks 2021

## Category
* Objects - Custom